{
  "roleKey": "alchemist",
  "title": "Alchemist",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "You have a Minion ability. When using this, the Storyteller may prompt you to choose differently.",
  "summary": "The Alchemist has a Minion ability.\n-  The Alchemist’s ability is usually that of a not-in-play Minion, but can duplicate an in-play Minion ability. \n-  The Alchemist learns which ability this is on the first night.\n-  They are still a good Townsfolk. They win when good wins, and lose when good loses. They register as good and as the Alchemist.\n-  The Alchemist does not wake to learn who the other Minions are or who the Demon is, like Minions do.\n-  If the Alchemist’s Minion ability adds or removes characters during setup, this still occurs during setup. \n-  If the Alchemist has an ability where the player chooses something, like the Poisoner or the Vizier, the Storyteller may ask the Alchemist to choose differently. The Alchemist must do so.",
  "howToRun": "During the first night, wake the Alchemist. Show the YOU ARE info token then the character token of a Minion. Put the Alchemist to sleep. If the Alchemist has a not-in-play Minion ability, mark the Alchemist with the IS THE ALCHEMIST reminder and swap the Alchemist token with this Minion token and turn it upside down. (This shows they are still good.)\n\nThe Alchemist has this Minion ability. They use it as if they were a Minion, and wake at night when that Minion would normally wake to use their ability.\n\nIf the Alchemist makes a choice using their ability, you may ask them to choose differently. If this is during the day, ask verbally. If this is during the night, shake your head, point at the Alchemist ability text on the character sheet, and wait for the Alchemist to choose again.",
  "examples": [
    "The Alchemist has the Baron ability. There are 2 extra Outsiders in play.",
    "The Alchemist has the Poisoner's ability. On the first night, they wake and poison the Wizard. On the second night, they wake and poison the Alsaahir. On the third night, they wake and try to poison the Lord of Typhon, but the Storyteller prompts them to choose differently. They poison the King instead. The Lord of Typhon is not poisoned."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "firstNight",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "during the night (text)",
        "first night (text)",
        "at night (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "REGISTRATION_MODIFIER",
      "registersAs": [
        "good"
      ],
      "scope": "always",
      "evidence": [
        "register as (text)"
      ]
    },
    {
      "kind": "GLOBAL_RULE",
      "ruleKey": "ALCHEMIST",
      "activeWhile": "alive",
      "resolution": "automatic",
      "evidence": [
        "good wins (text)",
        "good loses (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "first_night",
      "description": "You have a Minion ability. When using this, the Storyteller may prompt you to choose differently.",
      "resolution": {
        "stKind": "RESOLVE/alchemist/action",
        "description": "Resolve alchemist day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "during the night (text)",
        "first night (text)",
        "at night (text)",
        "during the day (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Boffin",
      "withKey": "boffin",
      "alignment": "Evil",
      "text": "If the Alchemist has the Boffin ability, the Alchemist does not learn what ability the Demon has."
    },
    {
      "with": "Marionette",
      "withKey": "marionette",
      "alignment": "Evil",
      "text": "An Alchemist-Marionette has no Marionette ability & the Marionette is in play."
    },
    {
      "with": "Mastermind",
      "withKey": "mastermind",
      "alignment": "Evil",
      "text": "An Alchemist-Mastermind has no Mastermind ability & the Mastermind is not-in-play."
    },
    {
      "with": "Organ Grinder",
      "withKey": "organgrinder",
      "alignment": "Evil",
      "text": "If the Alchemist has the Organ Grinder ability, the Organ Grinder is in play. If both are sober, both are drunk."
    },
    {
      "with": "Spy",
      "withKey": "spy",
      "alignment": "Evil",
      "text": "An Alchemist-Spy has no Spy ability & a Spy is in play. After each execution, a living Alchemist-Spy may publicly guess a living player as the Spy. If correct, the Demon must choose the Spy tonight."
    },
    {
      "with": "Summoner",
      "withKey": "summoner",
      "alignment": "Evil",
      "text": "The Alchemist-Summoner does not get bluffs, and chooses which Demon but not which player. If they die before this happens, evil wins. [No Demon]"
    },
    {
      "with": "Widow",
      "withKey": "widow",
      "alignment": "Evil",
      "text": "An Alchemist-Widow has no Widow ability & a Widow is in play. After each execution, a living Alchemist-Widow may publicly guess a living player as the Widow. If correct, the Demon must choose the Widow tonight."
    },
    {
      "with": "Wraith",
      "withKey": "wraith",
      "alignment": "Evil",
      "text": "An Alchemist-Wraith has no Wraith ability & a Wraith is in play. After each execution, a living Alchemist-Wraith may publicly guess a living player as the Wraith. If correct, the Demon must choose the Wraith tonight."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": true,
    "isGlobalRule": true
  },
  "stKinds": [
    "INFO/alchemist",
    "RESOLVE/alchemist/action",
    "RULES/alchemist_global_rule",
    "WINCHECK/alchemist"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller may\"."
  ]
}