{
  "roleKey": "banshee",
  "title": "Banshee",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "If the Demon kills you, all players learn this. From now on, you may nominate twice per day and vote twice per nomination.",
  "summary": "The Banshee becomes more powerful when dead, nominating and voting twice as much.\n-  When alive, the Banshee nominates and votes as normal.\n-  When dead, they may nominate twice per day, even though dead players may normally not nominate at all.\n-  When dead, they may vote for any nomination they wish and do not need a vote token to do so. They may vote twice for the same nomination.\n-  The Banshee only gains these powers if they were killed by the Demon. Dying by execution or to a non-Demon ability does not count.\n-  To vote twice, the Banshee player raises both hands when votes are counted. If the player is unable to do this due to a disability, the Storyteller can count their normal vote twice.",
  "howToRun": "If the Banshee is killed by the Demon, place the HAS ABILITY reminder token next to the Banshee and say “The Banshee has awoken” or something similarly dramatic. The Banshee may nominate twice per day, but it is the player’s responsibility to remember how many times they have nominated. The Banshee may raise two hands when voting. When counting the votes, count each hand as a vote.\n\nIf the Banshee is killed by the Demon but does not have their ability at that time or is killed by a non-Demon ability, then do not tell the group that the Banshee ability has been triggered. The Banshee may not nominate, and needs a vote token to vote, like a regular dead player.\n\nIf all good players are dead, the game continues. Good can still win due to the Banshee being able to nominate.",
  "examples": [
    "The Kazali kills the Banshee. All players learn that the Banshee has died. Tomorrow, the Banshee nominates the Village Idiot and votes twice, then nominates the Fearmonger and votes twice, then votes twice when the Shugenja is nominated. The next day, the Banshee doesn’t nominate at all, but votes twice for the Kazali.",
    "The Banshee is poisoned. The Ojo kills the Banshee. Nobody learns that the Banshee has died, and for the rest of the game, the Banshee may not nominate, and has just one vote.",
    "The Lycanthrope kills the Banshee. The Banshee does not gain their additional powers and is not announced."
  ],
  "setupModifications": [
    {
      "kind": "SETUP_CONSTRAINT",
      "constraintKey": "REMINDER_TOKEN_PLACE_THE_HAS_ABILITY",
      "payload": {
        "token": "place the HAS ABILITY",
        "description": "place the HAS ABILITY reminder token is marked during setup."
      },
      "reason": "Reminder token instructions detected",
      "evidence": [
        "place the HAS ABILITY reminder token"
      ]
    }
  ],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [],
  "jinxes": [
    {
      "with": "Leviathan",
      "withKey": "leviathan",
      "alignment": "Evil",
      "text": "Each night*, the Leviathan chooses an alive good player (different to previous nights): a chosen Banshee dies & gains their ability."
    },
    {
      "with": "Riot",
      "withKey": "riot",
      "alignment": "Evil",
      "text": "Each night*, Riot chooses an alive good player (different to previous nights): a chosen Banshee dies & gains their ability."
    },
    {
      "with": "Vortox",
      "withKey": "vortox",
      "alignment": "Evil",
      "text": "If the Vortox kills the Banshee, all players learn that the Banshee has died."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": true,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/banshee"
  ]
}