{
  "roleKey": "bishop",
  "title": "Bishop",
  "category": "traveller",
  "editionTags": [],
  "abilityText": "Only the Storyteller can nominate. At least 1 opposing player must be nominated each day.",
  "summary": "The Bishop prevents players from nominating at all. Instead, the Storyteller does all nominating.\n-  The Storyteller makes nominations during the nomination process instead of the players, and the Storyteller may nominate as few or as many players as they wish. To make things fair, they must nominate at least one player whose alignment is opposite the Bishop’s alignment each day.\n-  The Bishop does not alter who can and cannot vote. Each player may do so normally.\n-  Since Travellers are exiled, not executed, any player may call for the Bishop or another Traveller to be exiled.",
  "howToRun": "Each dawn, mark the good Bishop with their NOMINATE EVIL reminder, or mark the evil Bishop with their NOMINATE GOOD reminder.\n\nDuring the nomination process for execution, the players cannot make nominations, but you can. (Voting happens as normal.) When you nominate a player whose alignment is opposite the alignment of the Bishop, remove the Bishop’s reminder. You cannot end the nomination process if the Bishop is marked with their reminder.\n\nUsually, you’ll want to nominate about three to five players each day, with at least one of them being evil. You do not have to nominate the Demon each day, but you should nominate all alive players on the final day. Which players you nominate is up to you, but it’s best to nominate more evil players if the Bishop is good, and to nominate fewer evil players if the Bishop is evil.",
  "examples": [
    "The Bishop is good. On the first day, the Storyteller nominates the Demon, a Minion, and two Townsfolk. On the second day, the Storyteller nominates a Minion and Outsider.",
    "The Bishop is evil. The Storyteller has nominated nobody. However, the Storyteller must nominate at least one good player today, so they choose the Minstrel. The next day, the Storyteller nominates four good players and the Demon. The Bishop is exiled that day, and now the players may continue the nomination process normally."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "each_day",
      "description": "Only the Storyteller can nominate. At least 1 opposing player must be nominated each day.",
      "resolution": {
        "stKind": "RESOLVE/bishop/action",
        "description": "Resolve bishop day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each day (text)"
      ]
    }
  ],
  "jinxes": [],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/bishop/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller may\"."
  ]
}