{
  "roleKey": "boomdandy",
  "title": "Boomdandy",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "If you are executed, all but 3 players die. After a 10 to 1 countdown, the player with the most players pointing at them, dies.",
  "summary": "The Boomdandy explodes when executed, killing most other players.\n-  If the Boomdandy is executed, the Storyteller kills other players, one at a time, until only three are left alive.\n-  The Demon will be one of the remaining three players (otherwise, the game would be over).\n-  Afterward, there is no further nomination or execution today. Instead, the Storyteller counts down from ten and all players point at the player they want to die. When the countdown ends, the Storyteller counts the number of fingers pointed at each player. If it is a tie, the day ends (and evil probably wins due to the Demon killing that night).\n-  Even dead players who have no vote token may point.\n-  Players may change who they are pointing at up until the countdown ends, at which point their decision is final.\n-  The Boomdandy only explodes due to an execution. Deaths by other means, such as via a Golem or a Psychopath, don’t count. If the Boomdandy is executed but doesn’t die (due to a Devil’s Advocate etc.), they still explode.\n-  If a character can’t die, such as the Fool or the Sailor, the Storyteller may rule that four players remain alive after a Boomdandy explosion.",
  "howToRun": "If the Boomdandy is executed, declare that the Boomdandy has exploded. Enter the circle, put your hand out towards the Boomdandy, and rotate around the circle. (Similar to running a vote.) When your hand reaches a living player, say “You live” or say “You die” as that player dies. When you have completed the circle, three players will be alive, including the Demon. Then, count down from ten. After you say “one”, ask all players to immediately freeze (to stay still) while you count the number of players who are pointing at each player. The player with the most fingers pointed at them, dies. This will end the game, since just two players are alive, so declare which team has won.\n\nYour countdown should be longer than ten seconds, and as slow, dramatic, or erratic as you like!",
  "examples": [
    "Amy is the Boomdandy. She is executed. She explodes, killing all players except for the Po, the Widow, and the Fortune Teller. Frantically, all players start pointing at each other, and talking about who should be pointed at. After counting down, the Storyteller calls “Freeze” and the Widow has the most number of fingers pointed at them, and dies. Evil wins."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "GLOBAL_RULE",
      "ruleKey": "BOOMDANDY",
      "activeWhile": "alive",
      "resolution": "automatic",
      "evidence": [
        "evil wins (text)"
      ]
    }
  ],
  "activeAbilities": [],
  "jinxes": [
    {
      "with": "Plague Doctor",
      "withKey": "plaguedoctor",
      "alignment": "Good",
      "text": "If the Storyteller would gain the Boomdandy ability, a player becomes the Boomdandy."
    }
  ],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": true
  },
  "stKinds": [
    "RULES/boomdandy_global_rule",
    "WINCHECK/boomdandy"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller may\"."
  ]
}