{
  "roleKey": "chambermaid",
  "title": "Chambermaid",
  "category": "townsfolk",
  "editionTags": [
    "Bad Moon Rising"
  ],
  "abilityText": "Each night, choose 2 alive players (not yourself): you learn how many woke tonight due to their ability.",
  "summary": "The Chambermaid learns who woke up at night.\n-  Each night, the Chambermaid chooses two players and learns if they woke tonight. They must choose alive players, and may not choose themself. This does not detect which of those players woke, only how many.\n-  This ability only detects characters who woke in order to use their ability. It does not detect characters who woke for any other reason—such as if the Storyteller woke a Minion to let them know who the Demon is, woke the Demon to give them their starting Demon info, woke a player due to the ability of a different character, or woke someone accidentally.\n-  If the character woke on a previous night but not this night, they are not detected by the Chambermaid.\n-  Players that woke tonight due to their ability but are drunk or poisoned still count as having woke tonight.\n-  If the Chambermaid chooses a dead player accidentally, the Storyteller prompts them to choose again.",
  "howToRun": "Each night, wake the Chambermaid. They point at any two alive players except themself. Show the Chambermaid fingers (0, 1, or 2) equaling the number of chosen characters who woke tonight. Put the Chambermaid to sleep.\n\nDo not wake the Chambermaid if there are not two players alive to be chosen (due to the Mastermind, Zombuul, etc.).",
  "examples": [
    "The Chambermaid chooses the Exorcist and the Innkeeper, and learns a \"2.\" The next night, the Exorcist chooses the Shabaloth, which will wake the Shabaloth. Later, Chambermaid chooses the Shabaloth and the Fool. Since the Shabaloth only woke due to the Exorcist ability, the Chambermaid learns a \"0\".",
    "It is the second night. The Chambermaid chooses the Grandmother and the evil Goon, and learns a \"2.\" Only the Goon will wake tonight, but the Chambermaid is drunk.",
    "It is the first night. The Chambermaid chooses the Assassin and the Moonchild, and learns a \"0\" because the Assassin does not wake to use their ability on the first night. The next night, they choose the Assassin and the Gossip. The Assassin woke but did not use their ability. The Gossip ability is used, but the Gossip does not wake to use it. The Chambermaid learns a \"1\"."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "firstNight",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "first_night",
      "description": "Each night, choose 2 alive players (not yourself): you learn how many woke tonight due to their ability.",
      "resolution": {
        "stKind": "RESOLVE/chambermaid/action",
        "description": "Resolve chambermaid night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 2,
          "description": "Choose 2 players"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Mathematician",
      "withKey": "mathematician",
      "alignment": "Good",
      "text": "The Chambermaid can detect if the Mathematician will wake tonight."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/chambermaid",
    "RESOLVE/chambermaid/action"
  ]
}