{
  "roleKey": "chef",
  "title": "Chef",
  "category": "townsfolk",
  "editionTags": [
    "Trouble Brewing"
  ],
  "abilityText": "You start knowing how many pairs of evil players there are.",
  "summary": "The Chef knows if evil players are sitting next to each other.\n-  On the first night, the Chef learns exactly how many pairs of evil players there are in total. A pair is two players, but one player may be a part of two pairs. So, two players sitting next to each other is one pair. Three players sitting next to each other is two pairs. Four players sitting next to each other is three pairs. And so on.\n-  The Chef detects evil Travellers just like other character types, but only if those Travellers joined the game before the Chef acts.",
  "howToRun": "During the first night, wake the Chef. Show the Chef fingers (0, 1, 2, etc.) equaling the number of pairs of neighboring evil players. Put the Chef to sleep.",
  "examples": [
    "No evil players are sitting next to each other. The Chef learns a '0'.",
    "The Imp is sitting next to the Baron. Across the circle, the Poisoner is sitting next to the Scarlet Woman. The Chef learns a '2'.",
    "An evil  is sitting between the Imp and a Minion. Across the circle, two other Minions are sitting next to each other. The Chef learns a '3'.",
    "The Recluse is sitting between the Imp and the Poisoner. The Chef learns a '1'. Here, the Recluse is registering as evil for the Imp-Recluse pair, but as good for the Poisoner-Recluse pair."
  ],
  "setupModifications": [
    {
      "kind": "START_KNOWING",
      "recipients": "self",
      "payload": {
        "detail": "Start knowledge inferred from description"
      },
      "reason": "Start knowledge phrases detected",
      "evidence": [
        "start knowing (text)",
        "you start knowing (text)"
      ]
    }
  ],
  "nightOrderSteps": [
    {
      "when": "firstNight",
      "blocksNight": true,
      "description": "Role flagged as acting at night via Trouble Brewing facts.",
      "evidence": [
        "chef listed as night action (fact list)"
      ]
    }
  ],
  "onMoments": [
    {
      "moment": "MOMENT_REGISTRATION_CHECKED",
      "description": "Storyteller validates this character during registration.",
      "evidence": [
        "registration check list (fact)"
      ]
    }
  ],
  "passiveAbilities": [],
  "activeAbilities": [],
  "jinxes": [],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": true,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/chef",
    "TRIGGER/chef/MOMENT_REGISTRATION_CHECKED"
  ],
  "factTags": [
    "registration-check"
  ]
}