{
  "roleKey": "goon",
  "title": "Goon",
  "category": "outsider",
  "editionTags": [
    "Bad Moon Rising"
  ],
  "abilityText": "Each night, the 1st player to choose you with their ability is drunk until dusk. You become their alignment.",
  "summary": "The Goon is immune to other characters at night, but keeps changing allegiances. \n-  Each night, the first time a player wakes to use their ability and chooses the Goon, that player becomes drunk immediately. Their ability does not work tonight, nor the next day.\n-  Later on the same night, if another player wakes to use their ability and chooses the Goon, their ability works as normal.\n-  The Goon cannot make a player drunk unless the player chose the Goon. The Storyteller choosing the Goon due to an ability, such as the Grandmother’s, doesn’t count.\n-  As soon as the Goon makes a player drunk, the Goon changes alignment to match theirs. The Goon still changes alignment, and makes the player drunk, if the player choosing the Goon was already drunk or poisoned.\n-  If chosen by the Assassin, the Goon dies but still turns evil.",
  "howToRun": "At night, if a player chooses to use their ability on the Goon and nobody is marked with the Goon’s DRUNK reminder, this player immediately becomes drunk—mark them with the DRUNK reminder. Finish resolving this player’s ability and put them to sleep. If this player’s alignment is different from the Goon’s alignment, rotate the Goon’s character token—right side up for good, upside-down for evil—to match this player’s alignment, then wake the Goon, give them a thumbs-up or a thumbs-down (indicating their new alignment), then put the Goon to sleep.\n\nThe next dusk, the player that the Goon made drunk becomes sober—remove the Goon’s DRUNK reminder.",
  "examples": [
    "The Courtier chooses the Goon. The Goon turns good, and the Courtier becomes drunk.",
    "The Shabaloth attacks the Goon, then the Gossip. Since the Shabaloth became drunk as soon as they chose the Goon, neither player dies tonight, and the Goon turns evil. The next night, the Shabaloth attacks the Gambler then the Goon. The Gambler dies, then the Shabaloth becomes drunk again. The Goon is still alive and still evil.",
    "The Chambermaid chooses the Goon and the Minstrel, and learns a \"1\" because the Chambermaid is drunk.",
    "The Tea Lady neighbours the good Goon and the Tinker. The Tinker is executed, but does not die. The next day, the Goon is evil. The Tinker is executed again and dies."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "everyNight",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "at night (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "DEATH_PREVENTION",
      "cause": "any",
      "scope": "self",
      "resolution": "automatic",
      "evidence": [
        "does not die (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "each_night",
      "description": "Each night, the 1st player to choose you with their ability is drunk until dusk. You become their alignment.",
      "resolution": {
        "stKind": "RESOLVE/goon/action",
        "description": "Resolve goon night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "at night (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Boffin",
      "withKey": "boffin",
      "alignment": "Evil",
      "text": "If the Demon has the Goon ability, they can’t turn good due to this ability."
    },
    {
      "with": "Pit-Hag",
      "withKey": "pithag",
      "alignment": "Evil",
      "text": "If the Pit-Hag turns an evil player into the Goon, they can't turn good due to their own ability."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/goon",
    "RESOLVE/goon/action"
  ]
}