{
  "roleKey": "gunslinger",
  "title": "Gunslinger",
  "category": "traveller",
  "editionTags": [],
  "abilityText": "Each day, after the 1st vote has been tallied, you may choose a player that voted: they die.",
  "summary": "The Gunslinger kills players who vote.\n-  Each day, after the first vote for execution has been tallied, the Gunslinger may publicly choose a player that just voted to die immediately. The Gunslinger does not have to kill a player—it is entirely up to them. Whether they use their ability or not, the Gunslinger cannot kill any further players that day.\n-  It is the Gunslinger’s responsibility to speak up and let the Storyteller know that they wish to use their ability.\n-  Since exiles are not affected by character abilities in any way, the Gunslinger cannot use their ability to kill a player that supports an exile.",
  "howToRun": "Each day, immediately after the first vote for execution is tallied, the Gunslinger can declare that they wish to use their ability. If so, the Gunslinger points at any player who voted for this execution. The chosen player dies.\n\nIf the Gunslinger is a new player, you may wish to remind them that they can use their ability.\n\nWhen the Gunslinger wants to use their ability, you may need to ask all players who voted to raise their hand again, so the Gunslinger doesn’t accidentally choose a player that didn’t vote.",
  "examples": [
    "The Imp has been nominated. There are 10 players alive, and five votes for the Imp, so the Imp is about to die. The Gunslinger chooses a voting player to die. They die, and the nomination continues, with the Imp still about to die.",
    "The players exile the . Then, the Butler is nominated for execution and gets one vote. This is the first nomination for execution, since the ’s exile does not count. The Gunslinger  chooses to kill the single voting player. Later that day, the Saint is nominated and six players vote. The Gunslinger  cannot use their ability now because this is not the first vote for execution today."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "each_day",
      "description": "Each day, after the 1st vote has been tallied, you may choose a player that voted: they die.",
      "resolution": {
        "stKind": "RESOLVE/gunslinger/action",
        "description": "Resolve gunslinger day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each day (text)",
        "publicly choose (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/gunslinger/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"you may need to\"."
  ]
}