{
  "roleKey": "librarian",
  "title": "Librarian",
  "category": "townsfolk",
  "editionTags": [
    "Trouble Brewing"
  ],
  "abilityText": "You start knowing that 1 of 2 players is a particular Outsider. (Or that zero are in play.)",
  "summary": "The Librarian learns that a particular Outsider character is in play, but not exactly which player it is.\n-  During the first night, the Librarian learns that one of two players is a specific Outsider.\n-  They learn this only once and then learn nothing more.\n-  The Drunk is an Outsider. If the Librarian learns that one of two players is the Drunk, they do not learn the Townsfolk that the Drunk's player thinks they are.",
  "howToRun": "While preparing the first night, put the Librarian's OUTSIDER reminder token by any Outsider character token, and put the Librarian's WRONG reminder token by any other character token.\n\nDuring the first night, wake the Librarian and point to the players marked OUTSIDER and WRONG. Show the character token marked OUTSIDER to the Librarian. Put the Librarian to sleep. Remove the Librarian's reminder tokens when convenient.",
  "examples": [
    "Benjamin is the Saint, and Filip is the Baron. The Librarian learns that either Benjamin or Filip is the Saint.",
    "There are no Outsiders in this game. The Librarian learns a '0'.",
    "Abdallah is the Drunk, who thinks they are the Monk, and Douglas is the Undertaker. The Librarian learns that either Abdallah or Douglas is the Drunk. (This happens because the Librarian learns the true character. The Drunk is Abdallah’s true character, not the Monk.)"
  ],
  "setupModifications": [
    {
      "kind": "START_KNOWING",
      "recipients": "self",
      "payload": {
        "detail": "One of two players is a specific Outsider or there are zero Outsiders in play.",
        "targetType": "outsider",
        "pairCount": 2,
        "zeroPossible": true
      },
      "reason": "Start knowledge phrases detected",
      "evidence": [
        "start knowing (text)",
        "you start knowing (text)"
      ]
    },
    {
      "kind": "SETUP_CONSTRAINT",
      "constraintKey": "REMINDER_TOKEN_OUTSIDER",
      "payload": {
        "token": "OUTSIDER",
        "placement": "any Outsider character",
        "description": "Place the OUTSIDER reminder token by any Outsider character."
      },
      "reason": "Reminder token instructions detected",
      "evidence": [
        "'s OUTSIDER reminder token by any Outsider character token"
      ]
    },
    {
      "kind": "SETUP_CONSTRAINT",
      "constraintKey": "REMINDER_TOKEN_WRONG",
      "payload": {
        "token": "WRONG",
        "placement": "any other character",
        "description": "Place the WRONG reminder token by any other character."
      },
      "reason": "Reminder token instructions detected",
      "evidence": [
        "'s WRONG reminder token by any other character token"
      ]
    }
  ],
  "nightOrderSteps": [
    {
      "when": "firstNight",
      "blocksNight": true,
      "description": "Role flagged as acting at night via Trouble Brewing facts.",
      "evidence": [
        "librarian listed as night action (fact list)"
      ]
    }
  ],
  "onMoments": [
    {
      "moment": "MOMENT_PUT_TO_SLEEP",
      "description": "Character is put to sleep after using this ability.",
      "evidence": [
        "Put the Librarian to sleep (text)"
      ]
    }
  ],
  "passiveAbilities": [],
  "activeAbilities": [],
  "jinxes": [],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": true,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/librarian",
    "TRIGGER/librarian/MOMENT_PUT_TO_SLEEP"
  ],
  "specialActions": [
    {
      "key": "PUT_TO_SLEEP",
      "description": "The storyteller puts the character to sleep once their action finishes.",
      "evidence": [
        "Put the Librarian to sleep (text)"
      ]
    }
  ]
}