{
  "roleKey": "lord_of_typhon",
  "title": "Lord of Typhon",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "Each night*, choose a player: they die. [Evil characters are in a line. You are in the middle. +1 Minion. -? to +? Outsiders]",
  "summary": "The Lord of Typhon is surrounded by Minions.\n-  All evil characters sit next to each other in a continuous line.\n-  All evil characters must be in the line at setup.\n-  Evil Travellers and Evil Townsfolk may be part of the line, but do not have to be.\n-  The Lord of Typhon must have an evil character on both sides. They cannot sit at the end of the line of evil characters.\n-  The evil team starts with one additional Minion when the Lord of Typhon is in play.\n-  Any number of Outsiders might be in play.\n-  Like the Marionette, the Storyteller decides which players are Minions during setup. The Storyteller also decides which player is which Minion.\n-  If a Lord of Typhon is created mid game, the Lord of Typhon does not need to sit in a line with the evil characters.",
  "howToRun": "During setup, remove all Minion tokens and add Townsfolk or Outsider tokens.\n\nDuring the first night, wake the appropriate number of players directly clockwise and counter-clockwise from the Lord of Typhon. Show each of these players a unique Minion token, and give a thumbs down. Replace these players' good character tokens with these Minion tokens and put these players to sleep. Then, do the Minion Info and Demon Info steps as normal.\n\nEach night except the first, wake the Lord of Typhon. They point at any player. That player dies—mark them with the DEAD reminder. Put the Lord of Typhon to sleep.",
  "examples": [
    "There are two Minions: the Organ Grinder and the Mezepheles. In between them, neighboring them both, sits the Lord of Typhon. The number of Outsiders is normal.",
    "The Vizier neighbors the Harpy, who neighbors the Lord of Typhon, who neighbors the Goblin. There are ten players, and two Outsiders in play, due to the Lord of Typhon ability.",
    "The Fearmonger neighbors the Boomdandy, who neighbors the Lord of Typhon, who neighbors the Poisoner, who neighbors the Mastermind. There are 15 players, but zero Outsiders in play, since the Lord of Typhon removed one Outsider, and the Puzzlemaster became the Boomdandy during the first night."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "otherNights",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "first night (text)",
        "night except the first (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "each_night",
      "description": "Each night*, choose a player: they die. [Evil characters are in a line. You are in the middle. +1 Minion. -? to +? Outsiders]",
      "resolution": {
        "stKind": "RESOLVE/lord_of_typhon/action",
        "description": "Resolve lord_of_typhon night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "first night (text)",
        "night except the first (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Summoner",
      "withKey": "summoner",
      "alignment": "Evil",
      "text": "If a Lord of Typhon is summoned, they must neighbor a Minion & their other neighbor becomes an evil Minion."
    }
  ],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/lord_of_typhon/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"the storyteller decides\"."
  ]
}