{
  "roleKey": "lycanthrope",
  "title": "Lycanthrope",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "Each night*, choose an alive player. If good, they die & the Demon doesn’t kill tonight. One good player registers as evil.",
  "summary": "The Lycanthrope roams at night, killing the innocent, whilst the Demon cowers indoors.\n-  The Lycanthrope must choose an alive player each night. If the Lycanthrope chooses a dead player, the Storyteller shakes their head no and prompts the Lycanthrope to choose a different player.\n-  If the player that the Lycanthrope chooses is good, that player dies, and the Demon cannot kill tonight.\n-  If the player the Lycanthrope attacks is evil, that player does not die, and the Demon may still kill tonight.\n-  If the Lycanthrope attacks a good player but that good player doesn’t die, the Demon may still kill tonight.\n-  While the Lycanthrope lives, one good player registers as evil. They cannot be killed by the Lycanthrope.\n-  This evil-registration does not effect win conditions. The good player that registers as evil still wins or loses with the good team.",
  "howToRun": "During setup, mark one good player with the Lycanthrope’s FAUX PAW reminder.\n\nEach night except the first, wake the Lycanthrope. They point at any player. Put the Lycanthrope to sleep. If the chosen player is good, that player dies—mark them with the Lycanthrope’s DEAD reminder. Later that night, wake the Demon, as normal, but the Demon cannot kill. If the chosen player is evil, nothing happens.",
  "examples": [
    "The Lycanthrope attacks the General. The General dies. Later that night, the Imp attacks the Amnesiac. The Amnesiac does not die, because the Imp cannot kill tonight.",
    "The Lycanthrope attacks the Farmer. The Farmer dies, and another good player becomes a Farmer. The Magician was poisoned by the Pukka last night but does not die tonight, because the Pukka cannot kill tonight.",
    "The Lycanthrope attacks the Godfather. The Godfather does not die, because the Godfather is evil. The Lycanthrope attacks the Zealot, who is registering as evil due to the Lycanthrope’s ability. The Zealot does not die. The Demon attacks the Lycanthrope and the Lycanthrope dies."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "otherNights",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "at night (text)",
        "night except the first (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "REGISTRATION_MODIFIER",
      "registersAs": [
        "evil"
      ],
      "scope": "always",
      "evidence": [
        "registers as (text)"
      ]
    },
    {
      "kind": "DEATH_PREVENTION",
      "cause": "demon_kill",
      "scope": "self",
      "resolution": "automatic",
      "evidence": [
        "does not die (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "each_night",
      "description": "Each night*, choose an alive player. If good, they die & the Demon doesn’t kill tonight. One good player registers as evil.",
      "resolution": {
        "stKind": "RESOLVE/lycanthrope/action",
        "description": "Resolve lycanthrope night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "at night (text)",
        "night except the first (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": true,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/lycanthrope/action"
  ]
}