{
  "roleKey": "mastermind",
  "title": "Mastermind",
  "category": "minion",
  "editionTags": [
    "Bad Moon Rising"
  ],
  "abilityText": "If the Demon dies by execution (ending the game), play for 1 more day. If a player is then executed, their team loses.",
  "summary": "The Mastermind can still win after the Demon is dead.\n-  If the Demon dies by execution, the game continues. The players do not learn that the Demon died. The following day, if a good player is executed—whether or not they die from it—then evil wins. If an evil player is executed or nobody is executed, then the good team wins.\n-  A dead Demon does not get to attack. They lose their ability, as normal. During this extra night and day, other characters’ abilities function as normal.\n-  If the Demon dies and just two players are left alive, the game still continues for another day—evil does not win from two players being alive, and good did not win by killing the Demon. The Mastermind ability says “play for one more day,” and abilities override standard game rules.",
  "howToRun": "If the Demon is executed and dies, and the game would end, continue playing the game. (Add a shroud as normal. Do not say that the Demon has died.)\n\nTomorrow, if a good player is executed, declare that the game ends and evil wins, but if an evil player or no player is executed, declare that the game ends and good wins.",
  "examples": [
    "The Shabaloth dies. The next day, the Professor is executed and dies. Evil wins.",
    "The Po dies. The next day, the Godfather is executed, but remains alive because they were protected by the Devil's Advocate. However, since an evil player was executed, good wins.",
    "The Zombuul is executed and appears to die. The Mastermind’s ability does not trigger yet, because the Zombuul's execution did not make the game end. When the Zombuul is executed a second time and dies for real, the Mastermind’s ability triggers, and the game continues for one more day.",
    "There are three players alive. The Demon dies. The following day, with just two players alive, good decides not to execute. When night falls, just two players are left alive but the Demon is dead, so good wins."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "GLOBAL_RULE",
      "ruleKey": "MASTERMIND",
      "activeWhile": "alive",
      "resolution": "automatic",
      "evidence": [
        "good wins (text)",
        "evil wins (text)",
        "good team wins (text)",
        "the good team wins (text)"
      ]
    }
  ],
  "activeAbilities": [],
  "jinxes": [
    {
      "with": "Al-Hadikhia",
      "withKey": "alhadikhia",
      "alignment": "Evil",
      "text": "If the Al-Hadikhia dies by execution, and the Mastermind is alive, the Al-Hadikhia chooses 3 good players tonight: if all 3 choose to live, evil wins. Otherwise, good wins."
    },
    {
      "with": "Alchemist",
      "withKey": "alchemist",
      "alignment": "Good",
      "text": "An Alchemist-Mastermind has no Mastermind ability & the Mastermind is not-in-play."
    },
    {
      "with": "Lleech",
      "withKey": "lleech",
      "alignment": "Evil",
      "text": "If the Mastermind is alive and the Lleech host dies by execution, the Lleech lives but loses their ability."
    },
    {
      "with": "Vigormortis",
      "withKey": "vigormortis",
      "alignment": "Evil",
      "text": "A Mastermind that has their ability keeps it if the Vigormortis dies."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": true
  },
  "stKinds": [
    "INFO/mastermind",
    "RULES/mastermind_global_rule",
    "WINCHECK/mastermind"
  ]
}