{
  "roleKey": "mutant",
  "title": "Mutant",
  "category": "outsider",
  "editionTags": [
    "Sects & Violets"
  ],
  "abilityText": "If you are \"mad\" about being an Outsider, you might be executed.",
  "summary": "The Mutant is killed if they try to reveal who they are. \n-  “Madness” is a term that means “you are trying to convince the group of something.” So, if the Mutant player is mad about being the Mutant, this means they are trying to convince people that they are the Mutant. If they are mad about being an Outsider, this means they are trying to convince people that they are an Outsider.\n-  This can be by verbally hinting who they are, or by their silence when questioned. It is always up to the Storyteller to decide what the Mutant is doing. If you think they are trying to convince the group they are an Outsider in any way, you can execute them—even outside the nomination phase, or at night. If you do, no other executions may happen today by normal means, since there is only one execution per day.\n-  If the Mutant hints that they are the Mutant at night, you may execute them that night, even if an execution happened today. Declare they have died, and continue the night phase as normal. An execution may still happen the next day.",
  "howToRun": "At any time (even at night), if you believe that the Mutant is mad about being an Outsider, then you can decide to execute the Mutant. Declare this to the group. They die - mark them with a shroud.\n\nIf you execute them during the day before the normal execution\nhappens, go to the night phase. (There is a maximum of one execution per day.)",
  "examples": [
    "Ten seconds into the first day, the Mutant says to the group that they’re the Mutant. The Storyteller declares that the Mutant is executed immediately. There is no nomination for an execution today, since there can be a maximum of one execution per day.",
    "A Witch privately talks to the Storyteller and says that Evin, who is playing the Mutant, told them they are the Klutz. The Storyteller chooses to execute the Mutant immediately.",
    "The Mutant tells the group that they are a Townsfolk, but does not say which one. When questioned if they are the Mutant, they stay silent. After a minute or so of silence, the Storyteller executes the Mutant.",
    "The Mutant says they are the Oracle, gives some bogus Oracle information, then says \"By the way, I am definitely not the Mutant\" while giving a subtle wink. The Storyteller chooses to execute the Mutant immediately."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [],
  "activeAbilities": [],
  "jinxes": [],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [],
  "todos": [
    "Storyteller discretion noted near \"storyteller chooses\"."
  ]
}