{
  "roleKey": "pukka",
  "title": "Pukka",
  "category": "demon",
  "editionTags": [
    "Bad Moon Rising"
  ],
  "abilityText": "Each night, choose a player: they are poisoned. The previously poisoned player dies then becomes healthy.",
  "summary": "The Pukka poisons its victims, who die at a later time.\n-  When the Pukka attacks, their victim is poisoned immediately. The next night, just after the Pukka attacks again, that player dies.\n-  Unlike other Demons, the Pukka acts during the first night.\n-  The Exorcist prevents the Pukka from waking to poison a player. The Innkeeper prevents the Pukka from killing a poisoned player, then that player is no longer poisoned.\n-  If the Pukka is drunk and chooses a player, that player does not become poisoned, so does not die the following night.\n-  If the Pukka was sober when they chose a player the previous night, but is drunk at night, that player does not die. But when the Pukka sobers up, the poison resumes and kills the player at night.",
  "howToRun": "Each night, wake the Pukka. They point at any player. Put the Pukka to sleep. The chosen player is poisoned—mark them with a POISONED reminder.\n\nEach night except the first, the other player marked POISONED dies—mark them with a DEAD reminder, then remove their POISONED reminder.\n\nPlayers that the Pukka kills are still poisoned at their time of death. If you are using characters from other editions, you may need to keep the POISONED reminder by the DEAD reminder until their death ability is resolved. For example, if the Pukka kills the Sage, the Sage may get false information due to being poisoned by the Pukka.",
  "examples": [
    "The Pukka poisons the Chambermaid. The Chambermaid gets false information. The next night, the Chambermaid dies.",
    "The Pukka poisons the Fool. The next day, the Fool is executed and dies because they have no ability. The next night, nobody dies and the Pukka poisons the Gossip. The next night, the Pukka is drunk and tries to poison the Tinker, but does not. The next night, the Gossip dies because the Pukka is sober.",
    "The Pukka poisons the Pacifist. The next night, the Exorcist chooses the Pukka to not wake tonight. The Pacifist dies, but the Pukka does not wake to attack tonight.",
    "The Moonchild is executed, dies, and chooses the Courtier. That night, the Pukka chooses the Moonchild. The Courtier does not die because the Moonchild is poisoned."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "otherNights",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)",
        "night except the first (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "DEATH_PREVENTION",
      "cause": "any",
      "scope": "self",
      "resolution": "automatic",
      "evidence": [
        "does not die (text)"
      ]
    },
    {
      "kind": "INFO_DISTORTION",
      "affects": "self",
      "policy": "false",
      "resolution": "st_request",
      "evidence": [
        "false information (text)",
        "false info (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "each_night",
      "description": "Each night, choose a player: they are poisoned. The previously poisoned player dies then becomes healthy.",
      "resolution": {
        "stKind": "RESOLVE/pukka/action",
        "description": "Resolve pukka night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)",
        "night except the first (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Summoner",
      "withKey": "summoner",
      "alignment": "Evil",
      "text": "The Summoner may summon a Pukka on the 2nd night instead of the 3rd."
    }
  ],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/pukka/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"you may need to\"."
  ]
}