{
  "roleKey": "recluse",
  "title": "Recluse",
  "category": "outsider",
  "editionTags": [
    "Trouble Brewing"
  ],
  "abilityText": "You might register as evil & as a Minion or Demon, even if dead.",
  "summary": "The Recluse might appear to be an evil character, but is actually good.\n-  Whenever the Recluse's alignment is detected, the Storyteller chooses whether the Recluse registers as good or evil.\n-  Whenever the Recluse is targeted by an ability that affects specific Minions or Demons, the Storyteller chooses whether the Recluse registers as that specific Minion or Demon.\n-  The Recluse may register as either good or evil, or as an Outsider, Minion, or Demon, at different parts of the same night. The Storyteller chooses whatever is most interesting.\n-  A Recluse that registers as a particular Minion or Demon does not have this character's ability. For example, a Recluse that registers as a Poisoner does not wake at night and cannot poison a player.",
  "howToRun": "Each time the Recluse is targeted by an ability that detects or affects evil characters, choose which character and alignment the Recluse registers as. (Do whatever is appropriate, such as showing an evil character token, nodding, giving finger signals, or allowing an ability to work that would normally only affect evil, Minion, or Demon players.)",
  "examples": [
    "The Slayer uses their ability on the Recluse. The Storyteller decides that the Recluse registers as the Imp, so the Recluse dies. The Slayer believes that they just killed the Imp.",
    "The Empath, who neighbours the Recluse and the Monk, learns she is neighbouring one evil player. The next night, the Empath learns they are neighbouring no evil players.",
    "The Investigator learns that either the Recluse or the Saint is the Scarlet Woman.",
    "The Recluse is executed. The Undertaker learns that the Imp was executed.",
    "The Recluse neighbours the Imp and an Evil Traveller. Because showing a \"2\" to the Chef might be too revealing, the Chef learns true information, a \"0,” instead."
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [
    {
      "moment": "MOMENT_REGISTRATION_CHECKED",
      "description": "Storyteller decides how this character registers during setup.",
      "evidence": [
        "misregistration fact list (fact)"
      ]
    }
  ],
  "passiveAbilities": [
    {
      "kind": "REGISTRATION_MODIFIER",
      "registersAs": [
        "evil",
        "good",
        {
          "roleKey": "that"
        },
        {
          "roleKey": "either"
        },
        {
          "roleKey": "particular"
        },
        {
          "roleKey": "poisoner"
        },
        {
          "roleKey": "the"
        }
      ],
      "scope": "sometimes",
      "evidence": [
        "register as (text)",
        "registers as (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "other",
      "usage": "variable",
      "description": "You might register as evil & as a Minion or Demon, even if dead.",
      "resolution": {
        "stKind": "RESOLVE/recluse/action",
        "description": "Resolve recluse other",
        "effectType": "applyEffect"
      },
      "evidence": [
        "at night (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Ogre",
      "withKey": "ogre",
      "alignment": "Good",
      "text": "If the Recluse registers as evil to the Ogre, the Ogre learns that they are evil."
    },
    {
      "with": "Sage",
      "withKey": "sage",
      "alignment": "Good",
      "text": "The Recluse might register as the Demon to the Sage."
    }
  ],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": false,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": true,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/recluse",
    "RESOLVE/recluse/action",
    "TRIGGER/recluse/MOMENT_REGISTRATION_CHECKED"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller chooses\".",
    "Storyteller discretion noted near \"the storyteller decides\"."
  ],
  "factTags": [
    "misregistration",
    "persists-through-death"
  ]
}