{
  "roleKey": "savant",
  "title": "Savant",
  "category": "townsfolk",
  "editionTags": [
    "Sects & Violets"
  ],
  "abilityText": "Each day, you may visit the Storyteller to learn 2 things in private: 1 is true & 1 is false.",
  "summary": "The Savant gets crazy, amazing information that is different every day and every game, but exactly half of it is completely false.\n-  Each day, the Storyteller chooses two pieces of information to give the Savant... so get creative! One must be true, and one must be false, and the Savant won’t know which is which.\n-  It is up to the Savant to talk with the Storyteller, not the other way around. This isn’t a public conversation, and the group can’t listen in. It’s private.\n-  The Savant can choose to not visit the Storyteller if they wish.\n-  A drunk or poisoned Savant might get two pieces of true information or two pieces of false information.",
  "howToRun": "Once per day, if the Savant requests a private chat with you, take them away from the circle so you cannot be overheard. Whisper two pieces of information, one true and one false, to the Savant. (If you cannot think of two straight away, either take your time or ask them to come back in a few minutes.)\n\nKeep the information you give helpful and related to the game. Avoid saying who exactly the Demon is, or it could be a very short game. If you need help on choosing what to say, give information similar to what Townsfolk abilities would provide.",
  "examples": [
    "The Savant learns that \"All players wearing glasses are good\" and that \"One player sitting on the black couch is a Minion.\"",
    "The Savant learns that \"A Snake Charmer is in play\" and \"Everybody got true information last night.\"",
    "The Savant learns that \"The Demon is a woman\" and \"Benjamin is evil.\"",
    "The Savant learns that \"Evin and Amy are the same alignment\" and \"There is one Outsider in play.\""
  ],
  "setupModifications": [],
  "nightOrderSteps": [],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "INFO_DISTORTION",
      "affects": "self",
      "policy": "false",
      "resolution": "st_request",
      "evidence": [
        "false information (text)",
        "false info (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "each_day",
      "description": "Each day, you may visit the Storyteller to learn 2 things in private: 1 is true & 1 is false.",
      "resolution": {
        "stKind": "RESOLVE/savant/action",
        "description": "Resolve savant day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each day (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": false,
    "actsAtNight": false,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/savant",
    "RESOLVE/savant/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller chooses\"."
  ]
}