{
  "roleKey": "snake_charmer",
  "title": "Snake Charmer",
  "category": "townsfolk",
  "editionTags": [
    "Sects & Violets"
  ],
  "abilityText": "Each night, choose an alive player: a chosen Demon swaps characters & alignments with you & is then poisoned.",
  "summary": "The Snake Charmer learns player after player that is not the Demon... but becomes the Demon if they get either too greedy or too bold.\n-  Each night, they choose a player. If that player is not the Demon, nothing happens. If they are the Demon, the Snake Charmer becomes that Demon and turns evil, and the Demon becomes good and poisoned permanently.\n-  If the Philosopher has the Snake Charmer ability and becomes the Demon, the Demon becomes a poisoned Philosopher.",
  "howToRun": "Each night, wake the Snake Charmer. They point at any player.\n\nIf that player is not the Demon, nothing happens. Put the Snake Charmer to sleep.\n\nIf that player is the Demon, the old Snake Charmer changes into the new (evil) Demon, and the old Demon changes into the new (good) Snake Charmer—swap the Snake Charmer token and the Demon’s token. The new Snake Charmer is poisoned - mark them with the POISONED reminder. Wake the new Demon and show them the YOU ARE info token, a thumbs-down, the YOU ARE token, then the Demon’s token. (This shows they are now evil and the Demon.) Put the new Demon to sleep. Wake the new Snake Charmer and show them the YOU ARE info token, a thumbs-up, the YOU ARE info token, then the Snake Charmer token. (This shows they are now good and the Snake Charmer.) Put the new Snake Charmer to sleep.\n\nIn the strange situation that the Snake Charmer is evil, or the Demon good, swap their alignments as appropriate.",
  "examples": [
    "The Snake Charmer chooses a player who is the Pit-Hag, so nothing happens. The Snake Charmer simply goes to sleep. The next night, the Snake Charmer chooses themself, so nothing happens.",
    "The Snake Charmer chooses a player who is the Vigormortis. The Snake Charmer immediately becomes the evil Vigormortis, and the Vigormortis becomes the good Snake Charmer and gets poisoned.",
    "The Pit-Hag turns themself into the Snake Charmer. Then, the Snake Charmer chooses a player who is the Fang Gu. The Snake Charmer becomes the Fang Gu, while the Fang Gu becomes the Snake Charmer and gets poisoned. Both remain evil."
  ],
  "setupModifications": [
    {
      "kind": "SETUP_CONSTRAINT",
      "constraintKey": "ROLE_CHANGED",
      "payload": {
        "description": "Role or alignment swap is established during setup"
      },
      "reason": "Role swap phrases detected",
      "evidence": [
        "becomes the demon (text)"
      ]
    }
  ],
  "nightOrderSteps": [
    {
      "when": "everyNight",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)"
      ]
    }
  ],
  "onMoments": [
    {
      "moment": "ROLE_CHANGED",
      "description": "Alignment or role status can change.",
      "evidence": [
        "becomes the demon (text)"
      ]
    },
    {
      "moment": "MOMENT_PUT_TO_SLEEP",
      "description": "Character is put to sleep after using this ability.",
      "evidence": [
        "Put the Snake Charmer to sleep (text)",
        "Put the new Demon to sleep (text)",
        "Put the new Snake Charmer to sleep (text)"
      ]
    }
  ],
  "passiveAbilities": [],
  "activeAbilities": [
    {
      "kind": "night_action",
      "usage": "each_night",
      "description": "Each night, choose an alive player: a chosen Demon swaps characters & alignments with you & is then poisoned.",
      "resolution": {
        "stKind": "RESOLVE/snake_charmer/action",
        "description": "Resolve snake_charmer night action",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [],
  "tags": {
    "isInfoRole": true,
    "isSetupModifier": true,
    "actsAtNight": true,
    "actsByClaim": false,
    "hasRoleSwap": true,
    "hasAlignmentSwap": true,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "INFO/snake_charmer",
    "RESOLVE/snake_charmer/action",
    "TRIGGER/snake_charmer/ROLE_CHANGED",
    "TRIGGER/snake_charmer/MOMENT_PUT_TO_SLEEP"
  ],
  "specialActions": [
    {
      "key": "PUT_TO_SLEEP",
      "description": "The storyteller puts the character to sleep once their action finishes.",
      "evidence": [
        "Put the Snake Charmer to sleep (text)",
        "Put the new Demon to sleep (text)",
        "Put the new Snake Charmer to sleep (text)"
      ]
    }
  ]
}