{
  "roleKey": "yaggababble",
  "title": "Yaggababble",
  "category": "experimental",
  "editionTags": [
    "Experimental Characters"
  ],
  "abilityText": "You start knowing a secret phrase. For each time you said it publicly today, a player might die.",
  "summary": "The Yaggababble kills by talking.\n-  The phrase that the Yaggababble says can be any length, but is usually 2 to 5 words long.\n-  If the Yaggababble says this phrase, the Storyteller may kill a player any time afterwards, until dawn.\n-  The Yaggababble may say this phrase as a standalone sentence, or part of another sentence.\n-  The Yaggababble may say this phrase multiple times per day. If so, the Storyteller may kill multiple players.\n-  The Storyteller chooses which players die. \n-  The Storyteller may choose to kill fewer players than the number of times the phrase was said.\n-  If the Yaggababble is drunk or poisoned, players cannot die, even if the Yaggababble was sober and healthy when they said their phrase. If the Yaggababble is sober and healthy, players might die, even if the Yaggababble was drunk or poisoned when they said their phrase.\n-  It is rare for the Yaggababble to kill during the day.",
  "howToRun": "During setup, write a phrase on a piece of paper, or on a phone.\n\nDuring the first night, wake the Demon. Show this phrase, then put them to sleep.\n\t\nEach time Demon says the secret phrase, put a DEAD reminder in the centre of the left side of the Grimoire, as a reminder to yourself to place it tonight.\n\t\nEach night, you may mark players with these DEAD reminders, and add a shroud to each marked player. These players die.\n\nChoose a phrase that is fairly plain. If the Demon has an unusual phrase each day, they will likely die or say it rarely. If the Demon has a common, believable phrase, they will likely say it each day, perhaps more than once each day.",
  "examples": [
    "The Yaggababble's phrase is \"that sounds fishy\". The Yaggababble says this once during the first day. That night, a player dies. The next day, the Yaggababble says \"that sounds fishy\" three times. That night, three players die.",
    "The Yaggababble has said their phrase twice today. A Witch is in play. When the Heretic nominates, the Heretic dies, even though they were not cursed by the Witch. The Golem nominates the Demon, and the Golem dies. Both players died due to the Yaggababble's ability."
  ],
  "setupModifications": [
    {
      "kind": "START_KNOWING",
      "recipients": "self",
      "payload": {
        "detail": "Start knowledge inferred from description"
      },
      "reason": "Start knowledge phrases detected",
      "evidence": [
        "start knowing (text)",
        "you start knowing (text)"
      ]
    }
  ],
  "nightOrderSteps": [
    {
      "when": "firstNight",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "DEATH_PREVENTION",
      "cause": "demon_kill",
      "scope": "self",
      "resolution": "st_request",
      "evidence": [
        "cannot die (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "each_day",
      "description": "You start knowing a secret phrase. For each time you said it publicly today, a player might die.",
      "resolution": {
        "stKind": "RESOLVE/yaggababble/action",
        "description": "Resolve yaggababble day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "first night (text)",
        "at night (text)",
        "during the day (text)",
        "each day (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Exorcist",
      "withKey": "exorcist",
      "alignment": "Good",
      "text": "If the Exorcist chooses the Yaggababble, the Yaggababble does not kill tonight."
    }
  ],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": true,
    "actsAtNight": true,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": false,
    "isGlobalRule": false
  },
  "stKinds": [
    "RESOLVE/yaggababble/action"
  ],
  "todos": [
    "Storyteller discretion noted near \"storyteller may\".",
    "Storyteller discretion noted near \"storyteller chooses\"."
  ]
}