{
  "roleKey": "zombuul",
  "title": "Zombuul",
  "category": "demon",
  "editionTags": [
    "Bad Moon Rising"
  ],
  "abilityText": "Each night*, if no-one died today, choose a player: they die. The 1st time you die, you live but register as dead.",
  "summary": "The Zombuul secretly remains alive while in the grave.\n-  When the Zombuul would die for any reason, they actually don’t die, but the Storyteller acts as if they died. The second time the Zombuul dies, they die for real and good wins.\n-  The seemingly dead Zombuul counts as a dead player in almost every way. The player’s life token on the Town Square flips to indicate their death. The next time they vote, they lose their vote token. They cannot nominate, they may vote with the Voudon, they’re not an alive neighbor for the Tea Lady, and so on. The only differences are that the game continues, the Zombuul still attacks, and the game continues if just two other players are alive.\n-  The Zombuul only wakes at night to attack if nobody died that day. If a dead player is executed, the player can’t die again, so the Zombuul would still wake.\n-  If a drunk or poisoned Zombuul dies, good wins. If a “dead” Zombuul becomes drunk or poisoned, do not announce that the player is alive.",
  "howToRun": "The first time the Zombuul would die, they remain alive. Declare that they died, but do not add a shroud to the Zombuul. (Flip the life token on the Town Square, as normal.) From now on, the\nZombuul registers as dead. \n\nEach day, if a player dies, mark them with the DIED TODAY reminder. (If the Zombuul “dies” by execution, they register as dead, so mark the Zombuul with the DIED TODAY reminder.)\n\nEach night except the first, if any player is marked DIED TODAY, do not wake the Zombuul.\n\nEach night except the first, if no player is marked DIED TODAY, wake the Zombuul. They point at any player. Put the Zombuul to sleep. The chosen player dies—mark them with the DEAD reminder.",
  "examples": [
    "The Zombuul is executed and appears to die. They cannot attack tonight. A few days later, only two players appear alive on the Town Square. The good team is fairly certain that one of the dead players is the Zombuul, and the game continues until one more player dies.",
    "Nobody died today. That night, the Zombuul attacks. The next day, the Tinker dies. That night, the Zombuul does not wake."
  ],
  "setupModifications": [],
  "nightOrderSteps": [
    {
      "when": "otherNights",
      "blocksNight": true,
      "description": "Wakes to use ability at night.",
      "evidence": [
        "each night (text)",
        "at night (text)",
        "night except the first (text)"
      ]
    }
  ],
  "onMoments": [],
  "passiveAbilities": [
    {
      "kind": "REGISTRATION_MODIFIER",
      "registersAs": [
        {
          "roleKey": "dead"
        }
      ],
      "scope": "always",
      "evidence": [
        "register as (text)",
        "registers as (text)"
      ]
    },
    {
      "kind": "GLOBAL_RULE",
      "ruleKey": "ZOMBUUL",
      "activeWhile": "alive",
      "resolution": "automatic",
      "evidence": [
        "good wins (text)"
      ]
    }
  ],
  "activeAbilities": [
    {
      "kind": "day_claim",
      "usage": "each_day",
      "description": "Each night*, if no-one died today, choose a player: they die. The 1st time you die, you live but register as dead.",
      "resolution": {
        "stKind": "RESOLVE/zombuul/action",
        "description": "Resolve zombuul day claim",
        "effectType": "applyEffect"
      },
      "evidence": [
        "each night (text)",
        "at night (text)",
        "night except the first (text)",
        "each day (text)",
        "choose (inferred)"
      ],
      "intent": {
        "requestChoice": {
          "targetCount": 1,
          "description": "Choose a player"
        }
      }
    }
  ],
  "jinxes": [
    {
      "with": "Summoner",
      "withKey": "summoner",
      "alignment": "Evil",
      "text": "If the Summoner summons a dead player into the Zombuul, the Zombuul has already \"died once\"."
    }
  ],
  "tags": {
    "isInfoRole": false,
    "isSetupModifier": false,
    "actsAtNight": true,
    "actsByClaim": true,
    "hasRoleSwap": false,
    "hasAlignmentSwap": false,
    "hasRegistrationWeirdness": true,
    "isGlobalRule": true
  },
  "stKinds": [
    "RESOLVE/zombuul/action",
    "RULES/zombuul_global_rule",
    "WINCHECK/zombuul"
  ]
}